# ============================================================
# Brewfile — single source of truth for all Homebrew packages
# ============================================================

brew "vim"
brew "tmux"
brew "ripgrep"
brew "fzf"
brew "htop"
brew "wget"
brew "zsh-autosuggestions"
brew "git"
brew "rust-analyzer"
brew "gleam"
brew "fnm"
brew "node"
brew "watchman"
brew "cocoapods"
brew "openjdk@17"
brew "opencode"
brew "mimo-code"
brew "gh"

# ---- GUI casks ----
cask "android-studio"
cask "brave-browser"
cask "helium-browser"
cask "miniconda"
